# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\DGilliland\Documents\GitHub\LB-RPPSOC\CE95352 Blinking LED\CE95352 Blinking LED.cydsn\CE95352 Blinking LED.cyprj
# Date: Fri, 09 Dec 2016 22:28:55 GMT
#set_units -time ns
create_clock -name {CyXTAL} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyPLL_OUT} -period 14.925373134328359 -waveform {0 7.46268656716418} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 14.925373134328359 -waveform {0 7.46268656716418} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} -nominal_period 62.5 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\DGilliland\Documents\GitHub\LB-RPPSOC\CE95352 Blinking LED\CE95352 Blinking LED.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\DGilliland\Documents\GitHub\LB-RPPSOC\CE95352 Blinking LED\CE95352 Blinking LED.cydsn\CE95352 Blinking LED.cyprj
# Date: Fri, 09 Dec 2016 22:28:48 GMT
